// 本檔案由 generateSidebar.cjs 自動產生
export default [
  {
    "items": [
      {
        "text": "2025-08-28",
        "link": "/blog/2025-08-28"
      },
      {
        "text": "從安卓再次換到iOS兩個月後，我的感受是什麼？",
        "link": "/blog/2025-08-25"
      },
      {
        "text": "衝動購物？才怪！Switch 2 開箱給你看看有多香！🤤",
        "link": "/blog/2025-07-18"
      },
      {
        "text": "颱風假咧？！😤 暴風圈是裝飾品膩？！",
        "link": "/blog/2025-07-06-typhoon"
      },
      {
        "text": "發燒啦！🔥 身體當機了！",
        "link": "/blog/2025-07-06"
      },
      {
        "text": "鋼索上的日子：一個年輕人的自由渴望",
        "link": "/blog/2025-06-13"
      },
      {
        "text": "台東好好玩",
        "link": "/blog/2025-06-12"
      },
      {
        "text": "生日禮物",
        "link": "/blog/2025-06-10-special"
      },
      {
        "text": "今天我生日！",
        "link": "/blog/2025-06-10"
      },
      {
        "text": "買到 Switch 2 啦！",
        "link": "/blog/2025-06-06"
      }
    ]
  },
  {
    "items": [
      {
        "text": "回文章列表",
        "link": "/blog/index"
      }
    ]
  }
]
