// 本檔案由 generateSidebar.cjs 自動產生
export default [
  {
    "items": [
      {
        "text": "發燒啦！🔥 身體當機了！",
        "link": "/blog/2025-07-06"
      },
      {
        "text": "鋼索上的日子：一個年輕人的自由渴望",
        "link": "/blog/2025-06-13"
      },
      {
        "text": "台東好好玩",
        "link": "/blog/2025-06-12"
      },
      {
        "text": "生日禮物",
        "link": "/blog/2025-06-10-special"
      },
      {
        "text": "今天我生日！",
        "link": "/blog/2025-06-10"
      },
      {
        "text": "買到 Switch 2 啦！",
        "link": "/blog/2025-06-06"
      },
      {
        "text": "明明可以避免的，為什麼還是讓它發生了？",
        "link": "/blog/2025-05-26"
      },
      {
        "text": "如何輕鬆地在VitePress寫部落格？",
        "link": "/blog/2025-05-25"
      }
    ]
  },
  {
    "items": [
      {
        "text": "回文章列表",
        "link": "/blog/index"
      }
    ]
  }
]
